In [21]:
import pandas as pd
import numpy as np
data = {
    'Id': ['H-20','B-30','E-40','M-90','D-50','A-60','F-70','L-80','K-90'],
    'Name': ['Alice', 'Bob', 'Charlie','Bob', np.nan,'Anny', 'Bobby', 'Charter',  np.nan],
    'Age': [24, 27,  np.nan,89, 32, 45, 33, 44,  np.nan],
    'City': [ np.nan, 'Los Angeles', 'Chicago', 'Los Angeles','Houston','Los Angeles','Houston','Chicago', np.nan]
}
df = pd.DataFrame(data)
df.columns=[0,1,2,3]
df

      0        1     2            3
0  H-20    Alice  24.0          NaN
1  B-30      Bob  27.0  Los Angeles
2  E-40  Charlie   NaN      Chicago
3  M-90      Bob  89.0  Los Angeles
4  D-50      NaN  32.0      Houston
5  A-60     Anny  45.0  Los Angeles
6  F-70    Bobby  33.0      Houston
7  L-80  Charter  44.0      Chicago
8  K-90      NaN   NaN          NaN

In [11]:
#Fetching data with row_index 5
df.iloc[5]

Id             A-60
Name           Anny
Age            45.0
City    Los Angeles
Name: 5, dtype: object

In [25]:
#Fetching data with row_index 5 and column_index 'Name'
df.iloc[5,1]

'Anny'

In [37]:
#Fetching data with multiple row_index [3,7] and column_index [1,3]
df.iloc[[3,7],[1,3]]

         1            3
3      Bob  Los Angeles
7  Charter      Chicago

In [39]:
#Fetching data only column_index [1,3]
df.iloc[:,[1,3]]

         1            3
0    Alice          NaN
1      Bob  Los Angeles
2  Charlie      Chicago
3      Bob  Los Angeles
4      NaN      Houston
5     Anny  Los Angeles
6    Bobby      Houston
7  Charter      Chicago
8      NaN          NaN

In [49]:
#Fetching data usng slice operator
df.iloc[1:5]

      0        1     2            3
1  B-30      Bob  27.0  Los Angeles
2  E-40  Charlie   NaN      Chicago
3  M-90      Bob  89.0  Los Angeles
4  D-50      NaN  32.0      Houston

In [51]:
#Fetching data using slice operator with Step2
df.iloc[1:5:2]

      0    1     2            3
1  B-30  Bob  27.0  Los Angeles
3  M-90  Bob  89.0  Los Angeles